tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "rbenv/tap"
brew "btop"
brew "openssl@3"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "git"
brew "jq"
brew "maven"
brew "neovim"
brew "node"
brew "p7zip"
brew "powerlevel10k"
brew "pyenv"
brew "ripgrep"
brew "sdl2"
brew "tmux"
brew "tree"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "jesseduffield/lazygit/lazygit"
cask "anki"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-sf-pro"
cask "intellij-idea-ce"
cask "jordanbaird-ice"
cask "qbittorrent"
cask "rectangle"
cask "sf-symbols"
cask "temurin"
vscode "alphabotsec.vscode-eclipse-keybindings"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "asvetliakov.vscode-neovim"
vscode "batisteo.vscode-django"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "drcika.apc-extension"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "humao.rest-client"
vscode "k--kato.intellij-idea-keybindings"
vscode "kevinrose.vsc-python-indent"
vscode "microprofile-community.mp-rest-client-generator-vscode-ext"
vscode "microprofile-community.mp-starter-vscode-ext"
vscode "microprofile-community.vscode-microprofile-pack"
vscode "moocfi.test-my-code"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "njpwerner.autodocstring"
vscode "open-liberty.liberty-dev-vscode-ext"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-community-server-connector"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-quarkus"
vscode "redhat.vscode-rsp-ui"
vscode "redhat.vscode-xml"
vscode "rust-lang.rust-analyzer"
vscode "tonybaloney.vscode-pets"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "wholroyd.jinja"
vscode "yinfei.luahelper"
